<?php
if (empty($_POST['step'])) {
    //запросы в бд отдаем свободные числа
    /*
запрос на сервер { 'date': '2023-11-20' }
ответ от сервера {'chislo':'2023-11-20','time_all':time_all[], 'time_free': time_free[]}

*/
    $time_all = [
        '8:00', '8:30', '9:00', '9:30', '10:00', '10:30', '11:00',
        '11:30', '12:00', '12:30', '13:00', '13:30', '14:00', '14:30',
        '15:00', '15:30', '16:00', '16:30', '17:00', '17:30',
        '18:00', '18:30', '19:00'
    ];
    $time_busy = [
        '8:00',  '9:00', '9:30', '10:00',  '11:00',
        '11:30',  '12:30', '13:00',
        '17:00', '17:30',
        '18:00', '18:30'
    ];

    echo json_encode(['chislo' => $_POST['date'], 'time_all' => $time_all, 'time_busy' => $time_busy]);
} else {
    //записываем в бд и ворачиваем ответ ok или error
    $name = $_POST['name'];
    echo "форма отправлена $name<br>";
}
//print_r($_POST);

// echo 'Имя: '.$_POST['name'];
// echo 'Фамилия: '.$_POST['surname'];
//echo json_encode(['name'=>$_POST['name'], 'surname'=>$_POST['surname']]);



/*
1. Приходит json {date:'2023-11-17'}
2. Далее делаем запрос в бд по указаной дате извлекам время записаных, если такой даты нет значит целый день свободны 
и преходим к пункту 4
3. Далее удаляем из массива time_arr удаляем одинаковые записи
4. и отдаем фронту, если массив пустой то шлем сообщение что бы выбрали другую дату

*/

?>